Revit 2015 API
DWFExportOptions Members
The DWFExportOptions type exposes the following members.
Constructors
Name | Description
DWFExportOptions
Default constructor. Sets all options to their default values.
Methods
Name | Description
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
CropBoxVisible
Whether to export crop box.
ExportingAreas
Whether to also export areas and rooms' geometry.
ExportObjectData
Whether to include properties associated with elements.
ImageFormat
Controls the compression level of images embedded.
ImageQuality
Image quality level when compressed raster format(JPEG) is used.
MergedViews
Whether to merge all views in one file.
PaperFormat
Standard paper format.
PortraitLayout
Paper orientation - Portrait/Landscape.
StopOnError
Whether export process should stop when a view fails to export.
See Also
DWFExportOptions Class
Autodesk.Revit.DB Namespace